import javax.swing.JFrame;
import javax.swing.JLabel;

class Story extends JFrame{
	JLabel story[]= {new JLabel("평범한 고등학생 OO"),
					new JLabel("평범한 일상."),
					new JLabel("평소와 똑같이 눈을 떴더니 지구가 보인다."),
					new JLabel("정신을 차리고 OO은 다시 눈 떠보니 우주정거장에 있다."),
					new JLabel("우주정거장에는 못 생기고 기괴하게 생긴 외계인이 있다."),
					new JLabel("민지는 처음에 외계인을 보고 너무 놀라서 한번 기절했었다."),
					new JLabel("민지는 다시 정신을 차린 후 마음 진정시켜서 외계인한테 여기가 어디인지 물어보기로 결심한다."),
					new JLabel("저기요.. 말씀 좀 여쭤도 되나요..?"),
					new JLabel("무슨 일이냐? 삐뻐뿨꺼")};

//	JLabel story;
//	String Tstory[]= {"저기요.. 말씀 좀 여쭤도 되나요..?",
//			"무슨 일이냐? 삐뻐뿨꺼",
//			"여기가 어디죠?",
//			"여기가 어디긴 화성이지 장난할 거면 그냥 가라. 띠삐뿨꺼?",
//			"아... 그렇군요.. 그러면 지구로 돌아가려면 어떻게 해야 해요?",
//			"띠삐뿨꺼? 지구에는 왜? 지구에 갈려면 우주선 타고 가야지.",
//			"우주선? 우주선을 타려면 어떻게 해야 하죠?",
//			"띠삐뿨꺼 요즘 경기가 워낙 안 좋아서 가격이 많이 올랐을텐데..... 얼마더라..",
//			"............",
//			"흐음 100만원이었던 것 같다 띠삐뿨꺼?",
//			"100만원이요? 너무 비싼데요!!",
//			"하아 돈을 어디서 구하지?",
//			"마침 저 앞에 카페 하나가 있는데 갑자기 알바생 하나가 그만둬서 점장이 엄청 곤란해 하고 있는데 가서 알바 써달라고 함 말해봐. 띠삐뿨꺼?",
//			"좋은 정보 고마워요!"};
//			
//	
//	for(int i=0; i<10; i++) {
//		story[i]=new JLabel(Tstroy[i]);
//	}
	
			
}
